{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Querying\n",
    "Record times to execute queries in different databases of variable sizes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import mysql.connector\n",
    "import os\n",
    "import time\n",
    "import pymongo\n",
    "import datetime\n",
    "import redis\n",
    "from redisgraph import Graph\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from insert import ins"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext dotenv\n",
    "%dotenv"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Some Constants"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "MYSQL = \"MySQL\"\n",
    "MONGO_DB = 'MongoDB'\n",
    "REDIS = 'Redis'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "HUNDRED = 'hundred'\n",
    "FIVE_HUNDRED = 'five_hundred'\n",
    "THOUSAND = 'thousand'\n",
    "TEN_THOUSAND = 'ten_thousand'\n",
    "LAKH = 'lakh'\n",
    "FIVE_MILLION = 'five_mil'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "def sql_query(query, cursor):\n",
    "    begin = time.time()\n",
    "    cursor.execute(query)\n",
    "    cursor.fetchall()\n",
    "    end = time.time()\n",
    "    return end - begin\n",
    "\n",
    "def mongo_query(db, col, query):\n",
    "    begin = time.time()\n",
    "    db[col].aggregate(query)\n",
    "    end = time.time()\n",
    "    return end - begin\n",
    "\n",
    "def redis_query(graph, query):\n",
    "    begin = time.time()\n",
    "    graph.query(query)\n",
    "    end = time.time()\n",
    "    return end - begin"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "def exp(size, insert=True):\n",
    "    if insert:\n",
    "        ins(size)\n",
    "    obs = {}\n",
    "    # MySQL\n",
    "    obs[MYSQL] = {}\n",
    "    try:\n",
    "        conn = mysql.connector.connect(\n",
    "            host='localhost',\n",
    "            database='social',\n",
    "            user=os.getenv('MYSQL_USER'),\n",
    "            password=os.getenv('MYSQL_PASS'),\n",
    "            auth_plugin='mysql_native_password'\n",
    "        )\n",
    "        cursor = conn.cursor()\n",
    "        # (1)\n",
    "        query = \"\"\"\n",
    "            SELECT name, surname \n",
    "            FROM user JOIN comment USING (user_id);\n",
    "        \"\"\"\n",
    "        obs[MYSQL][1] = sql_query(query, cursor)\n",
    "        # (2)\n",
    "        query = \"\"\"\n",
    "            SELECT * FROM user\n",
    "            JOIN comment USING (user_id)\n",
    "            WHERE text LIKE \"%today%\";\n",
    "        \"\"\"\n",
    "        obs[MYSQL][2] = sql_query(query, cursor)\n",
    "        # (3)\n",
    "        query = \"\"\"\n",
    "            SELECT\n",
    "                name,\n",
    "                surname,\n",
    "                created_at\n",
    "            FROM user JOIN comment USING (user_id)\n",
    "            WHERE\n",
    "                created_at >= CURRENT_DATE AND\n",
    "                created_at < DATE_ADD(CURRENT_DATE, INTERVAL 1 DAY);\n",
    "        \"\"\"\n",
    "        obs[MYSQL][3] = sql_query(query, cursor)\n",
    "        conn.close()\n",
    "    except mysql.connector.Error as error:\n",
    "        print(f\"Failed to connect to MySQL: {error}\")\n",
    "    # MongoDB\n",
    "    obs[MONGO_DB] = {}\n",
    "    client = pymongo.MongoClient('mongodb://localhost:27017/')\n",
    "    db = client['test']\n",
    "    # (1)\n",
    "    query = [\n",
    "        {\n",
    "            '$lookup': {\n",
    "                'from': 'comment',\n",
    "                'localField': '_id',\n",
    "                'foreignField': 'user_id',\n",
    "                'as': 'comments',\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            '$match': {\n",
    "                'comments': { '$not': { '$size': 0 } }\n",
    "            }\n",
    "        }\n",
    "    ]\n",
    "    obs[MONGO_DB][1] = mongo_query(db, 'user', query)\n",
    "    # (2)\n",
    "    query = [\n",
    "        {\n",
    "            '$match': {\n",
    "                'text': { '$regex': 'today' }\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            '$lookup': {\n",
    "                'from': 'user',\n",
    "                'localField': 'user_id',\n",
    "                'foreignField': '_id',\n",
    "                'as': 'user',\n",
    "            }\n",
    "        }\n",
    "    ]\n",
    "    obs[MONGO_DB][2] = mongo_query(db, 'comment', query)\n",
    "    # (3)\n",
    "    query = [\n",
    "        {\n",
    "            '$match': {\n",
    "                'created_at': { '$regex': f'^{datetime.date.today()}' }\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            '$lookup': {\n",
    "                'from': 'user',\n",
    "                'localField': 'user_id',\n",
    "                'foreignField': '_id',\n",
    "                'as': 'author',\n",
    "            }\n",
    "        }\n",
    "    ]\n",
    "    obs[MONGO_DB][3] = mongo_query(db, 'comment', query)\n",
    "    # Redis\n",
    "    SOCIAL = 'social'\n",
    "    obs[REDIS] = {}\n",
    "    client = redis.Redis(\n",
    "        host='localhost',\n",
    "        port=6379,\n",
    "    )\n",
    "    graph = Graph(SOCIAL, client)\n",
    "    # (1)\n",
    "    query = \"\"\"\n",
    "        MATCH r = (u:user)-[:wrote]->(c:comment)\n",
    "        RETURN r\n",
    "    \"\"\"\n",
    "    obs[REDIS][1] = redis_query(graph, query)\n",
    "    # (2)\n",
    "    query = \"\"\"\n",
    "        MATCH r = (u:user)-[:wrote]->(c:comment)\n",
    "        WHERE c.text CONTAINS 'today'\n",
    "        RETURN r\n",
    "    \"\"\"\n",
    "    obs[REDIS][2] = redis_query(graph, query)\n",
    "    # (3)\n",
    "    query = f\"\"\"\n",
    "        MATCH r = (u:user)-[:wrote]->(c:comment)\n",
    "        WHERE c.created_at STARTS WITH '%s'\n",
    "        RETURN r\n",
    "    \"\"\" % (f'{datetime.date.today()}')\n",
    "    obs[REDIS][3] = redis_query(graph, query)\n",
    "    print(obs)\n",
    "    return obs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Experiment"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "hundred\n",
      "\n",
      "MySQL\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "##########\n",
      "Inserting comments\n",
      "##########\n",
      "\n",
      "MongoDB\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "####################\n",
      "Inserting comments\n",
      "####################\n",
      "\n",
      "Redis\n",
      "----------\n",
      "Inserting users\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.259223\n",
      "Inserting comments\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.1977\n",
      "Creating relations\n",
      "##########\n",
      "{'MySQL': {1: 0.00413060188293457, 2: 0.07970905303955078, 3: 0.0010268688201904297}, 'MongoDB': {1: 0.03306746482849121, 2: 0.0017173290252685547, 3: 0.0010867118835449219}, 'Redis': {1: 0.006537675857543945, 2: 0.0007801055908203125, 3: 0.00055694580078125}}\n",
      "\n",
      "five_hundred\n",
      "\n",
      "MySQL\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "##########\n",
      "Inserting comments\n",
      "##########\n",
      "\n",
      "MongoDB\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "####################\n",
      "Inserting comments\n",
      "####################\n",
      "\n",
      "Redis\n",
      "----------\n",
      "Inserting users\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.198704\n",
      "Inserting comments\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.228696\n",
      "Creating relations\n",
      "##########\n",
      "{'MySQL': {1: 0.015064716339111328, 2: 0.539982795715332, 3: 0.002133607864379883}, 'MongoDB': {1: 0.06674647331237793, 2: 0.0008528232574462891, 3: 0.0005080699920654297}, 'Redis': {1: 0.012083768844604492, 2: 0.0007612705230712891, 3: 0.00040459632873535156}}\n",
      "\n",
      "thousand\n",
      "\n",
      "MySQL\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "##########\n",
      "Inserting comments\n",
      "##########\n",
      "\n",
      "MongoDB\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "####################\n",
      "Inserting comments\n",
      "####################\n",
      "\n",
      "Redis\n",
      "----------\n",
      "Inserting users\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.26705\n",
      "Inserting comments\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.223833\n",
      "Creating relations\n",
      "##########\n",
      "{'MySQL': {1: 0.02951955795288086, 2: 0.03324723243713379, 3: 0.0032198429107666016}, 'MongoDB': {1: 0.09136295318603516, 2: 0.0013675689697265625, 3: 0.0010421276092529297}, 'Redis': {1: 0.06814050674438477, 2: 0.0008876323699951172, 3: 0.0007178783416748047}}\n",
      "\n",
      "ten_thousand\n",
      "\n",
      "MySQL\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "##########\n",
      "Inserting comments\n",
      "##########\n",
      "\n",
      "MongoDB\n",
      "----------\n",
      "Deleting old records\n",
      "Inserting users\n",
      "####################\n",
      "Inserting comments\n",
      "####################\n",
      "\n",
      "Redis\n",
      "----------\n",
      "Inserting users\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 0.247487\n",
      "Inserting comments\n",
      "##########\n",
      "Cached execution 0.0\n",
      "internal execution time 1.537861\n",
      "Creating relations\n",
      "##########\n",
      "{'MySQL': {1: 0.08075118064880371, 2: 0.00867915153503418, 3: 0.0052492618560791016}, 'MongoDB': {1: 0.5689220428466797, 2: 0.007559537887573242, 3: 0.005949974060058594}, 'Redis': {1: 0.4005162715911865, 2: 0.0030274391174316406, 3: 0.002349853515625}}\n"
     ]
    }
   ],
   "source": [
    "result = {}\n",
    "\n",
    "SIZES = [\n",
    "    HUNDRED,\n",
    "    FIVE_HUNDRED,\n",
    "    THOUSAND,\n",
    "    TEN_THOUSAND\n",
    "]\n",
    "\n",
    "for size in SIZES:\n",
    "    print()\n",
    "    print(size)\n",
    "    result[size] = exp(size)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'hundred': {'MySQL': {1: 0.00413060188293457, 2: 0.07970905303955078, 3: 0.0010268688201904297}, 'MongoDB': {1: 0.03306746482849121, 2: 0.0017173290252685547, 3: 0.0010867118835449219}, 'Redis': {1: 0.006537675857543945, 2: 0.0007801055908203125, 3: 0.00055694580078125}}, 'five_hundred': {'MySQL': {1: 0.015064716339111328, 2: 0.539982795715332, 3: 0.002133607864379883}, 'MongoDB': {1: 0.06674647331237793, 2: 0.0008528232574462891, 3: 0.0005080699920654297}, 'Redis': {1: 0.012083768844604492, 2: 0.0007612705230712891, 3: 0.00040459632873535156}}, 'thousand': {'MySQL': {1: 0.02951955795288086, 2: 0.03324723243713379, 3: 0.0032198429107666016}, 'MongoDB': {1: 0.09136295318603516, 2: 0.0013675689697265625, 3: 0.0010421276092529297}, 'Redis': {1: 0.06814050674438477, 2: 0.0008876323699951172, 3: 0.0007178783416748047}}, 'ten_thousand': {'MySQL': {1: 0.08075118064880371, 2: 0.00867915153503418, 3: 0.0052492618560791016}, 'MongoDB': {1: 0.5689220428466797, 2: 0.007559537887573242, 3: 0.005949974060058594}, 'Redis': {1: 0.4005162715911865, 2: 0.0030274391174316406, 3: 0.002349853515625}}}\n"
     ]
    }
   ],
   "source": [
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def plot(heights, width=0.2):\n",
    "    fig = plt.subplots(figsize=(12, 8))\n",
    "    "
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "945d9b4b4e821cdfb190d8b9764f998578a4b0e911ae9f184bb6b843a583816f"
  },
  "kernelspec": {
   "display_name": "Python 3.9.10 64-bit (windows store)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
